IDENTIFICATION DIVISION.
PROGRAM-ID. MULTIPLY5.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 J         PIC 9 VALUE 1.
01 RESULT    PIC 99.

PROCEDURE DIVISION.
    PERFORM VARYING J FROM 1 BY 1 UNTIL J > 9
        COMPUTE RESULT = 5 * J
        DISPLAY "5 * " J " = " RESULT
    END-PERFORM.
    EXIT PROGRAM.
