       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTIL001.

       PROCEDURE DIVISION.
           DISPLAY "COMMON UTIL CALLED".
           STOP RUN.
