       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACC001.

       PROCEDURE DIVISION.
           DISPLAY "ACCOUNTING MODULE START".
           CALL 'UTIL001'.
           DISPLAY "ACCOUNTING MODULE END".
           STOP RUN.
