       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAY001.

       PROCEDURE DIVISION.
           DISPLAY "PAYROLL MODULE START".
           CALL 'UTIL001'.
           DISPLAY "PAYROLL MODULE END".
           STOP RUN.
