       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       PROCEDURE DIVISION.
           DISPLAY "MAIN START".
           CALL 'PAY001'.
           CALL 'ACC001'.
           DISPLAY "MAIN END".
           STOP RUN.
