       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       PROCEDURE DIVISION.
           CALL 'DAN2'
           CALL 'DAN3'
           CALL 'DAN4'
           CALL 'DAN5'
           CALL 'DAN6'
           CALL 'DAN7'
           CALL 'DAN8'
           CALL 'DAN9'
           STOP RUN.
       END PROGRAM MAIN.
